flyghost/OneOS-V2.1.0/drivers/hal/mm32/sdk/MM32F027XX_HAL/MM32F027x/Include/reg_usb.h
////////////////////////////////////////////////////////////////////////////////
/// @brief EPn_FIFO Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define EPn_FIFO_EPn_FIFO_Pos           (0)
#define EPn_FIFO_EPn_FIFO               (0xFFU << EPn_FIFO_EPn_FIFO_Pos)        ///< EPX FIFO port
////////////////////////////////////////////////////////////////////////////////
/// @brief EP_MEM Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define EP_MEM_FIFO_Pos                 (0)
#define EP_MEM_FIFO_0                   (0x00U << EP_MEM_FIFO_Pos)                  ///< EP0 Data storage address
#define EP_MEM_FIFO_1                   (0x01U << EP_MEM_FIFO_Pos)                  ///< EP1 Data storage address
#define EP_MEM_FIFO_2                   (0x02U << EP_MEM_FIFO_Pos)                  ///< EP2 Data storage address
#define EP_MEM_FIFO_3                   (0x03U << EP_MEM_FIFO_Pos)                  ///< EP3 Data storage address
#define EP_MEM_FIFO_4                   (0x04U << EP_MEM_FIFO_Pos)                  ///< EP4 Data storage address
////////////////////////////////////////////////////////////////////////////////
/// @brief EP_DMA Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define EP_DMA1EN_Pos                   (0)
#define EP_DMA1EN                       (0x01U << EP_DMA1EN_Pos)                ///< EP1 DMA enable
#define EP_DMA2EN_Pos                   (1)
#define EP_DMA2EN                       (0x01U << EP_DMA2EN_Pos)                ///< EP2 DMA enable

////////////////////////////////////////////////////////////////////////////////
/// @brief EP_HALT Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define EP_HALT_HALT0_Pos               (0)
#define EP_HALT_HALT0                   (0x01U << EP_HALT_HALT0_Pos)            ///< EP0 halt
#define EP_HALT_HALT1_Pos               (1)
#define EP_HALT_HALT1                   (0x01U << EP_HALT_HALT1_Pos)            ///< EP1 halt
#define EP_HALT_HALT2_Pos               (2)
#define EP_HALT_HALT2                   (0x01U << EP_HALT_HALT2_Pos)            ///< EP2 halt
#define EP_HALT_HALT3_Pos               (3)
#define EP_HALT_HALT3                   (0x01U << EP_HALT_HALT3_Pos)            //< EP3 halt
#define EP_HALT_HALT4_Pos               (4)
#define EP_HALT_HALT4                   (0x01U << EP_HALT_HALT4_Pos)            ///< EP4 halt

////////////////////////////////////////////////////////////////////////////////
/// @brief USB_POWER Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_POWER_SUSPEN_Pos            (0)
#define USB_POWER_SUSPEN                (0x01U << USB_POWER_SUSPEN_Pos)         ///< BUS suspend enable bit
#define USB_POWER_SUSP_Pos              (1)
#define USB_POWER_SUSP                  (0x01U << USB_POWER_SUSP_Pos)           ///< suspend status
#define USB_POWER_WKUP_Pos              (3)
#define USB_POWER_WKUP                  (0x01U << USB_POWER_WKUP_Pos)           ///< Enable controller wake up from suspend state
////////////////////////////////////////////////////////////////////////////////
/// @brief USB_AHB_DMA Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_AHB_DMA_CH0_BS_Pos          (0)
#define USB_AHB_DMA_CH0_BS              (0x01U << USB_AHB_DMA_CH0_BS_Pos)        ///< Channel 0 transmits 2 bytes at a time
#define USB_AHB_DMA_CH1_BS_Pos          (2)
#define USB_AHB_DMA_CH1_BS              (0x01U << USB_AHB_DMA_CH1_BS_Pos)        ///< Channel 1 transmits 2 bytes at a time
////////////////////////////////////////////////////////////////////////////////
/// @brief USB_AHB_RST Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_AHB_RST_EP0_Pos             (0)
#define USB_AHB_RST_EP0                 (0x01U << USB_AHB_RST_EP0_Pos)        ///< point 0 rest
#define USB_AHB_RST_EP1_Pos             (1)
#define USB_AHB_RST_EP1                 (0x01U << USB_AHB_RST_EP1_Pos)        ///< point 1 rest
#define USB_AHB_RST_EP2_Pos             (2)
#define USB_AHB_RST_EP2                 (0x01U << USB_AHB_RST_EP2_Pos)        ///< point 2 rest
#define USB_AHB_RST_EP3_Pos             (3)
#define USB_AHB_RST_EP3                 (0x01U << USB_AHB_RST_EP3_Pos)        ///< point 3 rest



/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
